/*
*   
*
*   样例输入：
*   样例输出：思政基础：93 信息技术基础：83 C语言程序设计：86
*            古小月：84 王小明：89 赵强：89 冯飞：81 张晓娜：91  倪妮：92
*/
#include <stdio.h>

int main(void)
{
    int i = 0;
    int j = 0;
    int s = 0;
    int v[3];
    int w[6];
    int a[3][6] = {
        {91, 93, 97, 92, 93, 95},
        {78, 81, 95, 67, 91, 90},
        {83, 94, 76, 85, 90, 93},
    };

    for(i = 0; i < 3; i++)
    {
        for(j = 0; j < 6; j++)
        {
            s += a[i][j];           /* 各科的分数累加 */
        }
        v[i] = s / 6;               /* 各科平均分 */
        s = 0;                      /* s 重新赋值 0 */
    }

    for(j = 0; j < 6; j++)
    {
        for(i = 0; i < 3; i++)
        {
            s += a[i][j];           /* 各人的分数累加 */
        }
        w[j] = s / 3;               /* 各人平均分 */
        s = 0;
    }

    printf("思政基础：%d 信息技术基础：%d C语言程序设计：%d\n", v[0], v[1], v[2]);
    printf("古小月：%d 王小明：%d 赵强：%d 冯飞：%d 张晓娜：%d  倪妮：%d\t",
			w[0], w[1], w[2], w[3], w[4], w[5]);

    return 0;
}
